<?php
/*******************************************************************************
 | Char.php ( 主頁面,圖表應用 )
 | -----------------------------------------------------------------------------
 | @package		    App
 | @subpackage		config
 | @Maintain:fangshf@gmail.com starts from 2015.03.18  
*******************************************************************************/
class Char extends Controller
{
  
  /**
   | -----------------------------------------------------------------------------
   | 必要!設定基礎view的名稱  
   | -----------------------------------------------------------------------------
  **/ 
  public function __Construct()
  {
    $this->views_name = 'char';
  }
  
  /**
   | -----------------------------------------------------------------------------
   | 預設顯示頁面  
   | -----------------------------------------------------------------------------
  **/ 
  public function index( $name = '' )
  {
    # 不另外處理,直接叫用現有function : 關於網站
    $user = $this->bar();
    # $user->name = $name;
    # $this->view('home/index', array('name' => $user->name));
  }
  
  /**
   | -----------------------------------------------------------------------------
   | 長條圖  
   | -----------------------------------------------------------------------------
  **/
  public function bar()
  {
     # 設定頁面名稱
     $this->sub_title = '長條圖';
     
     # 存放要在view裡動態顯示的資料陣列
     $dataArr = array();
     # 現在位置
     # $dataArr[] = array( '_POSTION', $this->get_postion( $this->views_name ));
     # 存放欲載入之view的html檔資料陣列
     $loadArr = array();
     $loadArr[] = 'bar';
     # 因為使用home的共用樣版，故叫直呼叫父類別的基本函式顯示即可
     $this->base_template( $dataArr, $loadArr );
  }
  
  /**
   | -----------------------------------------------------------------------------
   | 長條圖 , 範例資料 demo 用 
   | -----------------------------------------------------------------------------
  **/
  public function get_bardata()
  {
     $dataArr = array();
     $dataArr["xArr"] = array('一月','二月', '三月', '四月', '五月');
     $dataArr["yArr"] = array("fStart" => 0, "fMax" => 100, "fScore" => 10 );
     $dataArr["arrData"] = array(10,30,50,15,100 );
     $dataArr["arrDataLabel"] = array(10,30,50,15,100 );
     $this->show_json( $dataArr ) ;
  }
  

  
}