<?php
/*******************************************************************************
 | UsePHP.php ( 主頁面,PHP 撰寫習慣 )
 | -----------------------------------------------------------------------------
 | @package		    App
 | @subpackage		config
 | @Maintain:fangshf@gmail.com starts from 2015.03.18  
*******************************************************************************/
class UsePHP extends Controller
{
  
  /**
   | -----------------------------------------------------------------------------
   | 必要!設定基礎view的名稱  
   | -----------------------------------------------------------------------------
  **/ 
  public function __Construct()
  {
    $this->views_name = 'usephp';
  }
  
  /**
   | -----------------------------------------------------------------------------
   | 預設顯示頁面  
   | -----------------------------------------------------------------------------
  **/ 
  public function index( $name = '' )
  {
    # 不另外處理,直接叫用現有function : 關於網站
    $user = $this->note();
    # $user->name = $name;
    # $this->view('home/index', array('name' => $user->name));
  }
  
  /**
   | -----------------------------------------------------------------------------
   | 常用註解  
   | -----------------------------------------------------------------------------
  **/
  public function note()
  {
     # 設定頁面名稱
     $this->sub_title = '常用註解';
     
     # 存放要在view裡動態顯示的資料陣列
     $dataArr = array();
     # 現在位置
     # $dataArr[] = array( '_POSTION', $this->get_postion( $this->views_name ));
     # 存放欲載入之view的html檔資料陣列
     $loadArr = array();
     $loadArr[] = 'note';
     # 因為使用home的共用樣版，故叫直呼叫父類別的基本函式顯示即可
     $this->base_template( $dataArr, $loadArr );
  }
  

  
}