<?php
/*******************************************************************************
 | Controller.php ( 控制 model 與 views 的結合 )
 | -----------------------------------------------------------------------------
 | @package		    app
 | @subpackage		core 
 | @Maintain:fangshf@gmail.com starts from 2015.03.08 
*******************************************************************************/

class Controller
{
  /**
  | ----------------------------------------------------------------------------
  | 存放目前叫用的controll 名稱
  | ----------------------------------------------------------------------------
  **/
  protected $views_name = '_Controller';
  
  /**
  | ----------------------------------------------------------------------------
  | 存放目前位置陣列, 元素格式為陣列: array( '名稱','link' )
  | ----------------------------------------------------------------------------
  **/ 
  protected $postionArr = array( array( '首頁', G_SITEURL ) ); 
  
  /**
  | ----------------------------------------------------------------------------
  | 頁面提示
  | ----------------------------------------------------------------------------
  **/
  protected $sub_title = '基本控制項';
  
  /**
  | ----------------------------------------------------------------------------
  | 叫用 models裡的物件
  | ----------------------------------------------------------------------------
  **/ 
  protected function model( $model = '' )
  {
    require_once '../app/models/' . $model . '.php';
    return new $model();
  
  }
  
  /**
  | ----------------------------------------------------------------------------
  | 叫用 views裡的物件
  | ----------------------------------------------------------------------------
  **/ 
  protected function view( $view, $data = array() )
  {
     require_once '../app/views/' . $view . '.php';
     
  }
  
  /**
  | ----------------------------------------------------------------------------
  | 叫用 template 裡的物件
  | ----------------------------------------------------------------------------
  **/ 
  protected function template( $view = 'default', $dir='default' )
  {
     require_once '../app/core/Template.php';
     return new Template($view , $dir);
     
  }

  /**
  | ----------------------------------------------------------------------------
  | 叫用 ui裡的物件
  | ----------------------------------------------------------------------------
  **/ 
  protected function ui( $view = 'default', $dir = 'default' )
  {
     require_once '../app/core/Template.php';
     require_once '../app/core/Ui.php';
     return new Ui($view , $dir , $this->sub_title);
     
  }
  
  /**
   | -----------------------------------------------------------------------------
   | 常用共用樣版設定(整合tamplate)  
   | -----------------------------------------------------------------------------
  **/
  protected function base_template( $dataArr , $loadArr )
  {
     $tpl = $this->Template($this->views_name);
     $ui = $this->Ui('_base');
     $ui->header();
     $ui->menu();     
     foreach( $dataArr as $v )
     {
       $tpl->set( $v[0], $v[1]); 
     }
     foreach( $loadArr as $v)
     {
       $tpl->load($v, $v . '.html');
       $tpl->show($v);
     }
     $ui->footer();
  }

  /**
  | ----------------------------------------------------------------------------
  | 顯示 目前所在位置
  | ----------------------------------------------------------------------------
  **/ 
  protected function get_postion( $views = '' )
  {
     
     $str = '';
     $first_flag = 0;
     foreach( $this->postionArr as $k => $v )
     {
        if( $first_flag )
        {
          $str .= '&nbsp;&gt;&nbsp;';
        }
        else
        {
          $first_flag = 1;
        }
        
        if( $v[1] )
        {
          $str .= '<a href="' . $v[1] . '">' . $v[0] . '</a>';
        }
        else
        {
          $str .= '<span>' . $v[0] . '</span>';
        }
        
     }
     return $str;
  }
  
  /**
  | ----------------------------------------------------------------------------
  | 顯示 JSON 格式
  | ----------------------------------------------------------------------------
  **/ 
  protected function show_json( $dataArr )
  {
     $jsonData = array();
     $jsonData['msg'] = '可使用!';
     $jsonData['suss'] = '1';
     $jsonData['data'] = $dataArr;
     
     echo json_encode($jsonData);
     exit;
  }
  

}